---
kind: property
id: P:Autodesk.Revit.DB.SaveOptions.Compact
source: html/47161d62-18cb-f258-727c-eda2f5884ee1.htm
---
# Autodesk.Revit.DB.SaveOptions.Compact Property

Default is false: let the OS eliminate as much or as little dead data as it wants to.
 True: force the OS to eliminate all dead data from the file on disk.

## Syntax (C#)
```csharp
public bool Compact { get; set; }
```